solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_lcdif.c
    base->VDISPLAY0 =
        ((uint32_t)config->panelHeight << LCDIF_VDISPLAY0_DISPLAY_END_SHIFT) |
        (((uint32_t)config->panelHeight + config->vsw + config->vfp + config->vbp) << LCDIF_VDISPLAY0_TOTAL_SHIFT);

    /* HSYNC */
    regHsync = (((uint32_t)config->panelWidth + config->hfp) << LCDIF_HSYNC0_START_SHIFT) |
               (((uint32_t)config->panelWidth + config->hfp + config->hsw) << LCDIF_HSYNC0_END_SHIFT) |
               LCDIF_HSYNC0_PULSE_MASK;

    if ((uint32_t)kLCDIF_HsyncActiveHigh != (config->polarityFlags & (uint32_t)kLCDIF_HsyncActiveHigh))
    {
        regHsync |= LCDIF_HSYNC0_POLARITY_MASK;
    }

    base->HSYNC0 = regHsync;

    /* VSYNC */
    regVsync = (((uint32_t)config->panelHeight + config->vfp) << LCDIF_VSYNC0_START_SHIFT) |
               (((uint32_t)config->panelHeight + config->vfp + config->vsw) << LCDIF_VSYNC0_END_SHIFT) |
               LCDIF_VSYNC0_PULSE_MASK;

    if ((uint32_t)kLCDIF_VsyncActiveHigh != (config->polarityFlags & (uint32_t)kLCDIF_VsyncActiveHigh))
    {
        regVsync |= LCDIF_VSYNC0_POLARITY_MASK;
    }

    base->VSYNC0 = regVsync;

    /* DE, Data, clock. */
    regPanelConfig = LCDIF_PANELCONFIG0_DE_MASK | LCDIF_PANELCONFIG0_CLOCK_MASK;

    if ((uint32_t)kLCDIF_DataEnableActiveHigh != ((uint32_t)kLCDIF_DataEnableActiveHigh & config->polarityFlags))
    {
        regPanelConfig |= LCDIF_PANELCONFIG0_DE_POLARITY_MASK;
    }

    if ((uint32_t)kLCDIF_DriveDataOnRisingClkEdge ==
        ((uint32_t)kLCDIF_DriveDataOnRisingClkEdge & config->polarityFlags))
    {
        regPanelConfig |= LCDIF_PANELCONFIG0_CLOCK_POLARITY_MASK;
    }

#if defined(FSL_FEATURE_LCDIF_VERSION_DC8000) & FSL_FEATURE_LCDIF_VERSION_DC8000
    base->PANELCONFIG0 = regPanelConfig;
#else
    base->PANELCONFIG0 = regPanelConfig | LCDIF_PANELCONFIG0_SEQUENCING_MASK;
#endif
    return kStatus_Success;
}

#if defined(FSL_FEATURE_LCDIF_VERSION_DC8000) & FSL_FEATURE_LCDIF_VERSION_DC8000
/*!
 * @brief Gets default frame buffer configuration.
 *
 * Note: For LCDIF of version DC8000 there can be 3 layers in the pre-processing, compared with the older version. Apart
 * from the video layer, there are also 2 overlay layers which shares the same configurations. Use this API
 * to get the default configuration for all the 3 layers.
 *
 * @param config Pointer to the configuration structure.
 */
void LCDIF_FrameBufferGetDefaultConfig(lcdif_fb_config_t *config)
{
    assert(config != NULL);

    (void)memset(config, 0, sizeof(*config));

    config->enable         = true;
    config->rotateFlipMode = kLCDIF_Rotate0;
    config->inOrder        = kLCDIF_PixelInputOrderARGB;
    config->format         = kLCDIF_PixelFormatRGB565;
    config->standard       = kLCDIF_ConvertBT601;
    config->decompress     = kLCDIF_DecompressNone;

    /* kLCDIF_PorterDuffSrc */
    config->alpha.srcAlphaMode       = kLCDIF_AlphaStraight;
    config->alpha.srcGlobalAlphaMode = kLCDIF_AlphaLocal;
    config->alpha.srcFactorMode      = kLCDIF_AlphaFactorOne;
    config->alpha.useSrcAlpha        = (uint32_t) true;
    config->alpha.dstAlphaMode       = kLCDIF_AlphaStraight;
    config->alpha.dstGlobalAlphaMode = kLCDIF_AlphaLocal;
    config->alpha.dstFactorMode      = kLCDIF_AlphaFactorZero;
    config->alpha.useDstAlpha        = (uint32_t) true;
}

static uint32_t LCDIF_GetLayerConfig(const lcdif_fb_config_t *config)
{
    return LCDIF_FRAMEBUFFERCONFIG0_ROT_ANGLE(config->rotateFlipMode) |
           LCDIF_FRAMEBUFFERCONFIG0_UV_SWIZZLE(config->enableUVSwizzle) |
           LCDIF_FRAMEBUFFERCONFIG0_DEC_MODE(config->decompress) |
           LCDIF_FRAMEBUFFERCONFIG0_SWIZZLE(config->inOrder) |
           LCDIF_FRAMEBUFFERCONFIG0_COLOR_KEY_EN(config->colorkey.enable) |
           LCDIF_FRAMEBUFFERCONFIG0_ENABLE((uint32_t)config->enable) | ((uint32_t)config->format & 0x7UL);
}

/*!
 * brief Configure the video layer for LCDIF frame buffer.
 *
 * Note: For LCDIF of version DC8000 there can be 3 layers in the pre-processing, compared with the older version. Apart
 * from the video layer, there are also 2 overlay layers which shares the same configurations. Use this API
 * to configure the legacy video layer, and use @ref LCDIF_SetOverlayLayerConfig to configure the overlay layers.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param config Pointer to the configuration structure.
 */
void LCDIF_SetFrameBufferConfig(LCDIF_Type *base, uint8_t displayIndex, const lcdif_fb_config_t *config)
{
    assert(NULL != config);

    lcdif_reg32_convert_t pid;
    pid._alphaConfig = config->alpha;

    base->LAYERCLOCKGATE = (base->LAYERCLOCKGATE & (~LCDIF_LAYERCLOCKGATE_DISABLE_VIDEO_CLK_MASK)) |
                           LCDIF_LAYERCLOCKGATE_DISABLE_VIDEO_CLK(!config->enable);
    base->FRAMEBUFFERCONFIG0    = LCDIF_GetLayerConfig(config);
    base->FRAMEBUFFERCLEARVALUE = config->clearValue;
    base->VIDEOTL               = LCDIF_VIDEOTL_X(config->topLeftX) | LCDIF_VIDEOTL_Y(config->topLeftY);
    base->FRAMEBUFFERSIZE = LCDIF_FRAMEBUFFERSIZE_WIDTH(config->width) | LCDIF_FRAMEBUFFERSIZE_HEIGHT(config->height);
    base->FRAMEBUFFERCOLORKEY     = config->colorkey.lowValue;
    base->FRAMEBUFFERCOLORKEYHIGH = config->colorkey.highValue;
    base->VIDEOGLOBALALPHA        = (uint32_t)(pid._u32 >> 16U);
    base->VIDEOALPHABLENDCONFIG   = (pid._u32 & 0xFFFFUL);
    base->DCTILEINCFG0 = ((uint32_t)config->format >> 3U) | LCDIF_DCTILEINCFG0_YUV_STANDARD((uint32_t)config->standard);
}

/*!
 * brief Configure the video layer position.
 *
 * Note: For LCDIF of version DC8000 there can be 3 layers in the pre-processing, compared with the older version. Apart
 * from the video layer, there are also 2 overlay layers which shares the same configurations. Use this API
 * to configure the legacy video layer, and use @ref LCDIF_SetOverlayLayerPosition to configure the overlay layers.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param topLeftX The x value of thr top-left coordinate.
 * param topLeftY The y value of thr top-left coordinate.
 * param width The width of the layer.
 * param height The height of the layer.
 */
void LCDIF_SetFrameBufferPosition(
    LCDIF_Type *base, uint8_t displayIndex, uint16_t topLeftX, uint16_t topLeftY, uint16_t width, uint16_t height)
{
    base->VIDEOTL         = LCDIF_VIDEOTL_X(topLeftX) | LCDIF_VIDEOTL_Y(topLeftY);
    base->FRAMEBUFFERSIZE = LCDIF_FRAMEBUFFERSIZE_WIDTH(width) | LCDIF_FRAMEBUFFERSIZE_HEIGHT(height);
}

/*!
 * brief Configure the overlay layers for LCDIF frame buffer.
 *
 * Note: For LCDIF of version DC8000 there can be 3 layers in the pre-processing, compared with the older version. Apart
 * from the video layer, there are also 2 overlay layers which shares the same configurations. Use this API
 * to configure the overlay layers, and use @ref LCDIF_SetFrameBufferConfig to configure the legacy video layer.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param config Pointer to the configuration structure.
 * param layerIndex Pointer to the configuration structure.
 */
void LCDIF_SetOverlayLayerConfig(LCDIF_Type *base,
                                 uint8_t displayIndex,
                                 const lcdif_fb_config_t *config,
                                 uint8_t layerIndex)
{
    assert(NULL != config);

