solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_lcdif.c
    lcdif_reg32_convert_t pid;
    pid._alphaConfig = config->alpha;

    switch (layerIndex)
    {
        case 0U:
            base->OVERLAYCONFIG     = LCDIF_GetLayerConfig(config);
            base->OVERLAYCLEARVALUE = config->clearValue;
            base->LAYERCLOCKGATE    = (base->LAYERCLOCKGATE & (~LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY0_CLK_MASK)) |
                                   LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY0_CLK(!config->enable);
            base->OVERLAYTL       = LCDIF_OVERLAYTL_X(config->topLeftX) | LCDIF_OVERLAYTL_Y(config->topLeftY);
            base->OVERLAYSIZE     = LCDIF_OVERLAYSIZE_WIDTH(config->width) | LCDIF_OVERLAYSIZE_HEIGHT(config->height);
            base->OVERLAYCOLORKEY = config->colorkey.lowValue;
            base->OVERLAYCOLORKEYHIGH     = config->colorkey.highValue;
            base->OVERLAYGLOBALALPHA      = (uint32_t)(pid._u32 >> 16U);
            base->OVERLAYALPHABLENDCONFIG = (pid._u32 & 0xFFFFUL);
            base->DCOVERLAYTILEINCFG =
                ((uint32_t)config->format >> 3U) | LCDIF_DCTILEINCFG0_YUV_STANDARD((uint32_t)config->standard);
            break;

        case 1U:
            base->OVERLAYCONFIG1    = LCDIF_GetLayerConfig(config);
            base->OVERLAYCLEARVALUE = config->clearValue;
            base->LAYERCLOCKGATE    = (base->LAYERCLOCKGATE & (~LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY1_CLK_MASK)) |
                                   LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY1_CLK(!config->enable);
            base->OVERLAYTL1       = LCDIF_OVERLAYTL_X(config->topLeftX) | LCDIF_OVERLAYTL_Y(config->topLeftY);
            base->OVERLAYSIZE1     = LCDIF_OVERLAYSIZE_WIDTH(config->width) | LCDIF_OVERLAYSIZE_HEIGHT(config->height);
            base->OVERLAYCOLORKEY1 = config->colorkey.lowValue;
            base->OVERLAYCOLORKEYHIGH1     = config->colorkey.highValue;
            base->OVERLAYGLOBALALPHA1      = (uint32_t)(pid._u32 >> 16U);
            base->OVERLAYALPHABLENDCONFIG1 = (pid._u32 & 0xFFFFUL);
            break;

        default:
            /* Only 2 overlay layers. */
            assert(false);
            break;
    }
}

/*!
 * brief Configure the overlay layer position.
 *
 * Note: For LCDIF of version DC8000 there can be 3 layers in the pre-processing, compared with the older version. Apart
 * from the video layer, there are also 2 overlay layers which shares the same configurations. Use this API
 * to configure the overlay layers, and use @ref LCDIF_SetFrameBufferPosition to configure the legacy video layer.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param topLeftX The x value of thr top-left coordinate.
 * param topLeftY The y value of thr top-left coordinate.
 * param width The width of the layer.
 * param height The height of the layer.
 * param layerIndex Pointer to the configuration structure.
 */
void LCDIF_SetOverlayLayerPosition(LCDIF_Type *base,
                                   uint8_t displayIndex,
                                   uint16_t topLeftX,
                                   uint16_t topLeftY,
                                   uint16_t width,
                                   uint16_t height,
                                   uint8_t layerIndex)
{
    switch (layerIndex)
    {
        case 0U:
            base->OVERLAYTL   = LCDIF_OVERLAYTL_X(topLeftX) | LCDIF_OVERLAYTL_Y(topLeftY);
            base->OVERLAYSIZE = LCDIF_OVERLAYSIZE_WIDTH(width) | LCDIF_OVERLAYSIZE_HEIGHT(height);
            break;

        case 1U:
            base->OVERLAYTL1   = LCDIF_OVERLAYTL_X(topLeftX) | LCDIF_OVERLAYTL_Y(topLeftY);
            base->OVERLAYSIZE1 = LCDIF_OVERLAYSIZE_WIDTH(width) | LCDIF_OVERLAYSIZE_HEIGHT(height);
            break;

        default:
            /* Only 2 overlay layers. */
            assert(false);
            break;
    }
}

/*!
 * brief Get the alpha blend configuration by porter duff blend mode.
 *
 * param mode The blend mode.
 * param config Pointer to the configuration.
 * retval kStatus_Success Successfully get the configuration.
 * retval kStatus_InvalidArgument The blend mode not supported.
 */
status_t LCDIF_GetPorterDuffConfig(lcdif_porter_duff_blend_mode_t mode, lcdif_layer_alpha_blend_config_t *config)
{
    status_t status;

    lcdif_reg32_convert_t pid;

    static const uint32_t pdCtrl[] = {
        /* kLCDIF_PorterDuffSrc */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorOne) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorZero),

        /* kLCDIF_PorterDuffAtop */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorStraight) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorInversed),

        /* kLCDIF_PorterDuffOver */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorOne) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorInversed),

        /* kLCDIF_PorterDuffIn */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorStraight) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorZero),

        /* kLCDIF_PorterDuffOut */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorInversed) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorZero),

        /* kLCDIF_PorterDuffDst */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorZero) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorOne),

        /* kLCDIF_PorterDuffDstAtop */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorInversed) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorStraight),

        /* kLCDIF_PorterDuffDstOver */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorInversed) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorOne),

        /* kLCDIF_PorterDuffDstIn */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorZero) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorStraight),

