solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_lcdif.c
        /* kLCDIF_PorterDuffDstOut */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorZero) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorInversed),

        /* kLCDIF_PorterDuffPlus */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorOne) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorOne),

        /* kLCDIF_PorterDuffXor */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorInversed) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorInversed),

        /* kLCDIF_PorterDuffClear */
        LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK |
            LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(kLCDIF_AlphaFactorZero) |
            LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(kLCDIF_AlphaFactorZero),
    };

    if (mode >= kLCDIF_PorterDuffMax)
    {
        status = kStatus_InvalidArgument;
    }
    else
    {
        pid._u32 = pdCtrl[(uint32_t)mode] |
                   LCDIF_VIDEOALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE((uint32_t)kLCDIF_AlphaLocal) |
                   LCDIF_VIDEOALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE((uint32_t)kLCDIF_AlphaLocal) |
                   LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_FACTOR((uint32_t) false) |
                   LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_FACTOR((uint32_t) false) |
                   LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_MODE((uint32_t)kLCDIF_AlphaStraight) |
                   LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_MODE((uint32_t)kLCDIF_AlphaStraight);

        *config = pid._alphaConfig;

        status = kStatus_Success;
    }

    return status;
}

/*!
 * brief Sets the frame buffer address for overlay layer.
 *
 * note The address must be 128 bytes aligned.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param address Frame buffer address.
 * param layerIndex Pointer to the configuration structure.
 */
void LCDIF_SetOverlayLayerAddr(LCDIF_Type *base, uint8_t displayIndex, uint32_t address, uint8_t layerIndex)
{
    /* The frame buffer address and stride must be 128 bytes aligned. */
    assert(0U == (address & (LCDIF_FB_ALIGN - 1U)));
    assert(layerIndex < 2U);

    switch (layerIndex)
    {
        case 0U:
            base->OVERLAYADDRESS = LCDIF_ADDR_CPU_2_IP(address);
            break;

        case 1U:
            base->OVERLAYADDRESS1 = LCDIF_ADDR_CPU_2_IP(address);
            break;

        default:
            /* Only 2 overlay layers. */
            assert(false);
            break;
    }
}

/*!
 * brief Sets the frame buffer stride for overlay layer.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param strideBytes The stride in byte.
 * param layerIndex Pointer to the configuration structure.
 */
void LCDIF_SetOverlayLayerStride(LCDIF_Type *base, uint8_t displayIndex, uint32_t strideBytes, uint8_t layerIndex)
{
    assert(layerIndex < 2U);

    switch (layerIndex)
    {
        case 0U:
            base->OVERLAYSTRIDE = strideBytes;
            break;

        case 1U:
            base->OVERLAYSTRIDE1 = strideBytes;
            break;

        default:
            /* Only 2 overlay layers. */
            assert(false);
            break;
    }
}

/*!
 * brief Gets default panel configuration.
 *
 * The default configuration is
 *   config->enable = true;
 *   config->enableGamma = false;
 *   config->order       = kLCDIF_VideoOverlay0Overlay1;
 *   config->endian      = kLCDIF_NoSwap;
 *
 * param config Pointer to the configuration structure.
 */
void LCDIF_PanelGetDefaultConfig(lcdif_panel_config_t *config)
{
    assert(config != NULL);

    (void)memset(config, 0, sizeof(*config));

    config->enable      = true;
    config->enableGamma = false;
    config->order       = kLCDIF_VideoOverlay0Overlay1;
    config->endian      = kLCDIF_NoSwap;
}

/*!
 * brief Configure the LCDIF panel.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param config Pointer to the configuration structure.
 */
void LCDIF_SetPanelConfig(LCDIF_Type *base, uint8_t displayIndex, const lcdif_panel_config_t *config)
{
    assert(NULL != config);

    base->BLENDSTACKORDER = (uint32_t)config->order;
    base->SRCCONFIGENDIAN = (uint32_t)config->endian;
    base->PANELFUNCTION = (base->PANELFUNCTION & ~(LCDIF_PANELFUNCTION_OUTPUT_MASK | LCDIF_PANELFUNCTION_GAMMA_MASK)) |
                          LCDIF_PANELFUNCTION_OUTPUT((uint32_t)config->enable) |
                          LCDIF_PANELFUNCTION_GAMMA((uint32_t)config->enableGamma);
}

#else

/*!
 * @brief Get default frame buffer configuration.
 *
 * The default configuration is
 *   config->enable = true;
 *   config->enableGamma = false;
 *   config->format = kLCDIF_PixelFormatRGB565;
 *
 * @param config Pointer to the configuration structure.
 */
void LCDIF_FrameBufferGetDefaultConfig(lcdif_fb_config_t *config)
{
    assert(config != NULL);

    (void)memset(config, 0, sizeof(*config));

    config->enable      = true;
    config->enableGamma = false;
    config->format      = kLCDIF_PixelFormatRGB565;
}

/*!
 * brief Configure the LCDIF frame buffer.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param config Pointer to the configuration structure.
 */
void LCDIF_SetFrameBufferConfig(LCDIF_Type *base, uint8_t displayIndex, const lcdif_fb_config_t *config)
{
    assert(NULL != config);
    uint32_t reg;

    if (config->enable)
    {
        reg = LCDIF_FRAMEBUFFERCONFIG0_RESET_MASK | LCDIF_FRAMEBUFFERCONFIG0_OUTPUT_MASK | (uint32_t)config->format;
        if (config->enableGamma)
        {
            reg |= LCDIF_FRAMEBUFFERCONFIG0_GAMMA_MASK;
        }
        base->FRAMEBUFFERCONFIG0 = reg;
    }
    else
    {
        base->FRAMEBUFFERCONFIG0 = 0U;
    }
}

#endif

