solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_lcdif.c
/*
 * @brief Set the frame buffer stride.
 *
 * @param base LCDIF peripheral base address.
 * @param displayIndex Display index.
 * @param strideBytes The stride in byte.
 */
void LCDIF_SetFrameBufferStride(LCDIF_Type *base, uint8_t displayIndex, uint32_t strideBytes)
{
#if defined(FSL_FEATURE_LCDIF_VERSION_DC8000) & FSL_FEATURE_LCDIF_VERSION_DC8000
    base->FRAMEBUFFERSTRIDE0 = strideBytes;
#else
    base->FRAMEBUFFERSTRIDE0 = LCDIF_ALIGN_ADDR(strideBytes, LCDIF_FB_ALIGN);
#endif
}

/*!
 * brief Set the dither configuration.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Index to configure.
 * param config Pointer to the configuration structure.
 */
void LCDIF_SetDitherConfig(LCDIF_Type *base, uint8_t displayIndex, const lcdif_dither_config_t *config)
{
    assert(NULL != config);

    if (config->enable)
    {
        base->DISPLAYDITHERTABLELOW0  = config->low;
        base->DISPLAYDITHERTABLEHIGH0 = config->high;
#if defined(FSL_FEATURE_LCDIF_VERSION_DC8000) & FSL_FEATURE_LCDIF_VERSION_DC8000
        base->PANELFUNCTION |= LCDIF_PANELFUNCTION_DITHER_MASK;
#else
        base->DISPLAYDITHERCONFIG0 = ((uint32_t)config->redSize << LCDIF_DISPLAYDITHERCONFIG0_RED_SIZE_SHIFT) |
                                     ((uint32_t)config->greenSize << LCDIF_DISPLAYDITHERCONFIG0_GREEN_SIZE_SHIFT) |
                                     ((uint32_t)config->blueSize << LCDIF_DISPLAYDITHERCONFIG0_BLUE_SIZE_SHIFT) |
                                     LCDIF_DISPLAYDITHERCONFIG0_ENABLE_MASK;
#endif
    }
    else
    {
        base->DISPLAYDITHERTABLELOW0  = 0U;
        base->DISPLAYDITHERTABLEHIGH0 = 0U;
#if defined(FSL_FEATURE_LCDIF_VERSION_DC8000) & FSL_FEATURE_LCDIF_VERSION_DC8000
        base->PANELFUNCTION &= ~LCDIF_PANELFUNCTION_DITHER_MASK;
#else
        base->DISPLAYDITHERCONFIG0 = 0U;
#endif
    }
}

/*!
 * brief Set the gamma translation values to the LCDIF gamma table.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param startIndex Start index in the gamma table that the value will be set to.
 * param gamma The gamma values to set to the gamma table in LCDIF, could be defined using LCDIF_MAKE_GAMMA_VALUE.
 * param gammaLen The length of the p gamma.
 */
void LCDIF_SetGammaData(
    LCDIF_Type *base, uint8_t displayIndex, uint16_t startIndex, const uint32_t *gamma, uint16_t gammaLen)
{
    assert(startIndex + gammaLen <= LCDIF_GAMMA_INDEX_MAX);

    base->GAMMAINDEX0 = startIndex;

    while (0U != (gammaLen--))
    {
        base->GAMMADATA0 = *(gamma++);
    }
}

/*!
 * brief Initialize the LCDIF to work in DBI mode.
 *
 * This function configures the LCDIF DBI display.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param config Pointer to the configuration structure.
 * retval kStatus_Success Initialize successfully.
 * retval kStatus_InvalidArgument Initialize failed because of invalid argument.
 */
status_t LCDIF_DbiModeSetConfig(LCDIF_Type *base, uint8_t displayIndex, const lcdif_dbi_config_t *config)
{
    base->FRAMEBUFFERCONFIG0 = 0;

    base->PANELCONFIG0 = 0U;

    /* Set to DBI mode. */
    base->DBICONFIG0 = LCDIF_DBICONFIG0_DBI_AC_TIME_UNIT(config->acTimeUnit) |
#if (defined(FSL_FEATURE_LCDIF_HAS_DBIX_POLARITY) && FSL_FEATURE_LCDIF_HAS_DBIX_POLARITY)
                       LCDIF_DBICONFIG0_DBIX_POLARITY(config->reversePolarity ? 0UL : 1UL) |
#endif
                       LCDIF_DBICONFIG0_BUS_OUTPUT_SEL(1) | (uint32_t)config->format |
                       LCDIF_DBICONFIG0_DBI_TYPE(config->type);

    /*Put DBI bus into idle*/
    base->DBIIFRESET0 = LCDIF_DBIIFRESET0_DBI_IF_LEVEL_RESET_MASK;

    /*Config AC characteristics*/
    base->DBIWRCHAR10 = LCDIF_DBIWRCHAR10_DBI_WR_CS_ASSERT(config->writeCSAssert) |
                        LCDIF_DBIWRCHAR10_DBI_WR_EOR_WR_ASSERT(config->writeWRAssert) |
                        LCDIF_DBIWRCHAR10_DBI_WR_PERIOD(config->writeWRPeriod);

    base->DBIWRCHAR20 = LCDIF_DBIWRCHAR20_DBI_WR_CS_DE_ASRT(config->writeCSDeassert) |
                        LCDIF_DBIWRCHAR20_DBI_WR_EOR_WR_DE_ASRT(config->writeWRDeassert);

    return kStatus_Success;
}

/*!
 * brief Get the default configuration to initialize the LCDIF DBI mode.
 *
 * The default configuration value is:
 *
 * code
 * config->swizzle         = kLCDIF_DbiOutSwizzleRGB;
 * config->format          = kLCDIF_DbiOutD8RGB332;
 * config->acTimeUnit      = 0;
 * config->type            = kLCDIF_DbiTypeA_ClockedE;
 * config->reversePolarity = false;
 * config->writeWRPeriod   = 3U;
 * config->writeWRAssert   = 0U;
 * config->writeCSAssert   = 0U;
 * config->writeWRDeassert = 0U;
 * config->writeCSDeassert = 0U;
 * config->typeCTas        = 1U;
 * config->typeCSCLTwrl    = 1U;
 * config->typeCSCLTwrh    = 1U;
 * endcode
 *
 * param config Pointer to the LCDIF DBI configuration.
 */
void LCDIF_DbiModeGetDefaultConfig(lcdif_dbi_config_t *config)
{
    config->swizzle    = kLCDIF_DbiOutSwizzleRGB;
    config->format     = kLCDIF_DbiOutD8RGB332;
    config->acTimeUnit = 0;

#if (defined(FSL_FEATURE_LCDIF_HAS_DBI_TYPE) && FSL_FEATURE_LCDIF_HAS_DBI_TYPE)
    config->type = kLCDIF_DbiTypeA_ClockedE;
#endif

#if (defined(FSL_FEATURE_LCDIF_HAS_DBIX_POLARITY) && FSL_FEATURE_LCDIF_HAS_DBIX_POLARITY)
    config->reversePolarity = false;
#endif

    config->writeWRPeriod   = 3U;
    config->writeWRAssert   = 0U;
    config->writeCSAssert   = 0U;
    config->writeWRDeassert = 0U;
    config->writeCSDeassert = 0U;

#if (defined(FSL_FEATURE_LCDIF_HAS_TYPEC) && FSL_FEATURE_LCDIF_HAS_TYPEC)
    config->typeCTas     = 1U;
    config->typeCSCLTwrl = 1U;
    config->typeCSCLTwrh = 1U;
#endif
}

/*!
 * brief Select the update area in DBI mode.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param startX X coordinate for start pixel.
 * param startY Y coordinate for start pixel.
 * param endX X coordinate for end pixel.
 * param endY Y coordinate for end pixel.
 * param isTiled true if the pixel data is tiled.
 */
void LCDIF_DbiSelectArea(LCDIF_Type *base,
                         uint8_t displayIndex,
                         uint16_t startX,
                         uint16_t startY,
                         uint16_t endX,
                         uint16_t endY,
                         bool isTiled)
{
    uint16_t width  = endX - startX + 1U;
    uint16_t height = endY - startY + 1U;

    uint16_t vDisplayExtra = isTiled ? 2U : 1U; /* Used for waiting for the data FIFO to be filled */

    base->HDISPLAY0 = LCDIF_HDISPLAY0_DISPLAY_END((uint32_t)width) | LCDIF_HDISPLAY0_TOTAL((uint32_t)width);
    base->HSYNC0    = LCDIF_HSYNC0_START((uint32_t)startX) | LCDIF_HSYNC0_END((uint32_t)endX + 1UL);

    base->VDISPLAY0 = LCDIF_VDISPLAY0_DISPLAY_END((uint32_t)height) |
                      LCDIF_VDISPLAY0_TOTAL((uint32_t)height + (uint32_t)vDisplayExtra);

    if (isTiled)
    {
        base->VSYNC0 = LCDIF_VSYNC0_START((uint32_t)startY) | LCDIF_VSYNC0_END((uint32_t)endY + 1UL);
    }
}

/*!
 * brief Send data to DBI port.
 *
 * Can be used to send light weight data to panel. To send pixel data in frame buffer, use @ref LCDIF_DbiWriteMem.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param data pointer to data buffer.
 * param dataLen_Byte data buffer length in byte.
 */
void LCDIF_DbiSendData(LCDIF_Type *base, uint8_t displayIndex, const uint8_t *data, uint32_t dataLen_Byte)
{
    while (dataLen_Byte > 0U)
    {
        /* Send data. DBICMD bit set to 1, means currently send data, used in type C mode. */
        base->DBICMD0 = LCDIF_DBICMD0_DBI_COMMANDFLAG(kLCDIF_DbiCmdData) | (uint32_t)(*data) | (1UL << 8U);
        data++;
        dataLen_Byte--;
    }
}

/*!
 * brief Send command followed by data to DBI port.
 *
 * param base LCDIF peripheral base address.
 * param displayIndex Display index.
 * param cmd the DBI command to send.
 * param data pointer to data buffer.
 * param dataLen_Byte data buffer length in byte.
 */
void LCDIF_DbiSendCommandAndData(
    LCDIF_Type *base, uint8_t displayIndex, uint8_t cmd, const uint8_t *data, uint32_t dataLen_Byte)
{
    LCDIF_DbiSendCommand(base, displayIndex, cmd);
    LCDIF_DbiSendData(base, displayIndex, data, dataLen_Byte);
}

/*!
 * brief Get the hardware cursor default configuration
 *
 * The default configuration values are:
 *
 * code
 * config->enable = true;
 * config->format = kLCDIF_CursorMasked;
 * config->hotspotOffsetX = 0;
 * config->hotspotOffsetY = 0;
 * endcode
 *
 * param config Pointer to the hardware cursor configuration structure.
 */
void LCDIF_CursorGetDefaultConfig(lcdif_cursor_config_t *config)
{
    assert(NULL != config);

    (void)memset(config, 0, sizeof(*config));

    config->enable         = true;
    config->format         = kLCDIF_CursorMasked;
    config->hotspotOffsetX = 0;
    config->hotspotOffsetY = 0;
}

/*!
 * brief Configure the cursor.
 *
 * param base LCDIF peripheral base address.
 * param config Cursor configuration.
 */
void LCDIF_SetCursorConfig(LCDIF_Type *base, const lcdif_cursor_config_t *config)
{
    assert(NULL != config);

    uint32_t regConfig = 0U;

    if (config->enable)
    {
        regConfig |= (uint32_t)(config->format) << LCDIF_CURSORCONFIG_FORMAT_SHIFT;
        regConfig |= (((uint32_t)config->hotspotOffsetX << LCDIF_CURSORCONFIG_HOT_SPOT_X_SHIFT) |
                      ((uint32_t)config->hotspotOffsetY << LCDIF_CURSORCONFIG_HOT_SPOT_Y_SHIFT));
    }

    base->CURSORCONFIG = regConfig;
}

/*!
 * brief Set the cursor color
 *
 * param base LCDIF peripheral base address.
 * param background  Background color, could be defined use ref LCDIF_MAKE_CURSOR_COLOR
 * param foreground  Foreground color, could be defined use ref LCDIF_MAKE_CURSOR_COLOR
 */
void LCDIF_SetCursorColor(LCDIF_Type *base, uint32_t background, uint32_t foreground)
{
    base->CURSORBACKGROUND = background;
    base->CURSORFOREGROUND = foreground;
}
